---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentPrintingEventArgs
source: html/cae91da6-7e05-e47c-5957-15330428c303.htm
---
# Autodesk.Revit.DB.Events.DocumentPrintingEventArgs

The event arguments used by the DocumentPrinting event.

## Syntax (C#)
```csharp
public class DocumentPrintingEventArgs : RevitAPIPreDocEventArgs
```